In [1]:
import numpy as np
import pandas as pd

# series.where()  
- 把不满足条件的进行替换

In [14]:
s = pd.Series(np.random.randint(1, 10, 10))
s

0    6
1    2
2    5
3    3
4    7
5    3
6    6
7    4
8    3
9    6
dtype: int32

In [15]:
# 标量替换
s.where(s>5,1)

0    6
1    1
2    1
3    1
4    7
5    1
6    6
7    1
8    1
9    6
dtype: int32

In [16]:
# 序列替换
s.where(s>5, s*5)

0     6
1    10
2    25
3    15
4     7
5    15
6     6
7    20
8    15
9     6
dtype: int32

# series.mask()  
- 把满足条件的进行替换

In [18]:
# 标量替换
s.mask(s>5,1)

0    1
1    2
2    5
3    3
4    1
5    3
6    1
7    4
8    3
9    1
dtype: int32

In [19]:
# 序列替换
s.where(s>5, s*5)

0     6
1    10
2    25
3    15
4     7
5    15
6     6
7    20
8    15
9     6
dtype: int32

# dataframe.where()
- 不满足条件的进行替换

In [24]:
df = pd.DataFrame(np.random.randint(1, 10, (4, 5)))

In [25]:
df

   0  1  2  3  4
0  9  8  6  5  7
1  2  5  3  9  3
2  7  2  9  7  4
3  9  6  9  5  1

In [27]:
# 标量替换
df.where(df<5, 0)

   0  1  2  3  4
0  0  0  0  0  0
1  2  0  3  0  3
2  0  2  0  0  4
3  0  0  0  0  1

In [30]:
# 表替换
df.where(df>5, -df)

   0  1  2  3  4
0  9  8  6 -5  7
1 -2 -5 -3  9 -3
2  7 -2  9  7 -4
3  9  6  9 -5 -1

# dataframe.mask()
- 满足条件的进行替换

In [31]:
df

   0  1  2  3  4
0  9  8  6  5  7
1  2  5  3  9  3
2  7  2  9  7  4
3  9  6  9  5  1

In [33]:
# 标量替换
df.mask(df<5, 0)

   0  1  2  3  4
0  9  8  6  5  7
1  0  5  0  9  0
2  7  0  9  7  0
3  9  6  9  5  0

In [34]:
# 表替换
df.mask(df>5, -df)

   0  1  2  3  4
0 -9 -8 -6  5 -7
1  2  5  3 -9  3
2 -7  2 -9 -7  4
3 -9 -6 -9  5  1